DataProcessors/ФормаПросмотраОбращенияКлиента1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФормаПросмотраОбращенияКлиента1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекущееОбращение</Name>
					<Type>
						<v8:Type>cfg:DocumentObject.ОбращенияВПоддержку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияСообщений</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаписатьСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ссыль</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ФормаПросмотраОбращенияКлиента1/Forms/ФормаПросмотра/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Объект.ТекущееОбращение.Номер = Параметры.ПараметрФормыПросмотра.Номер; 
	Объект.ТекущееОбращение.Дата = Параметры.ПараметрФормыПросмотра.Дата;

	Объект.ТекущееОбращение.Статус = Параметры.ПараметрФормыПросмотра.Статус;
	Объект.ТекущееОбращение.Тема = Параметры.ПараметрФормыПросмотра.Тема;
	Объект.ТекущееОбращение.Клиент = Параметры.ПараметрФормыПросмотра.Клиент;
	Объект.ТекущееОбращение.Описание = Параметры.ПараметрФормыПросмотра.Описание; 
	Объект.Ссыль =  Параметры.ПараметрФормыПросмотра.Ссылка;
	
	Историяяя =  Параметры.ПараметрФормыПросмотра.ИсторияСообщений.Выгрузить();
	Объект.ТекущееОбращение.ИсторияСообщений.Загрузить(Историяяя);
	  
КонецПроцедуры 

&НаСервере
Процедура ПриОткрытииНаСервере()  
	
	ПолеЧата = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетHTML").ПолучитьТекст();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(); 
	
	//Формируем JavaScript код с реальными данными
	КодДляHTML = "const realMessages = [";
	ПервоеСообщение = Истина;
	
	Для Каждого Строка Из Объект.ТекущееОбращение.ИсторияСообщений Цикл
	    Если Не ПервоеСообщение Тогда
	        КодДляHTML = КодДляHTML + ",";
	    КонецЕсли;
	    
	    Текст = СтрЗаменить(Строка.Текст, """", "\""");
	    Текст = СтрЗаменить(Текст, "'", "\'");
	    Текст = СтрЗаменить(Текст, Символы.ПС, " ");
	    
	    КодДляHTML = КодДляHTML + "{";
	    КодДляHTML = КодДляHTML + "Текст: '" + Текст + "',";
	    КодДляHTML = КодДляHTML + "Автор: '" + Строка.Автор + "',";
	    КодДляHTML = КодДляHTML + "ДатаВремя: '" + Строка.ДатаВремя + "'";
	    КодДляHTML = КодДляHTML + "}";
	    
	    ПервоеСообщение = Ложь;
	КонецЦикла;
	
	КодДляHTML = КодДляHTML + "]; loadMessages(realMessages);";
	
	// Заменяем тестовые данные на реальные
	ПолеЧата = СтрЗаменить(ПолеЧата, 
	    "loadMessages(exampleMessages);", 
	    КодДляHTML);
		
		
КонецПроцедуры



&НаСервере
Процедура ОбновитьHTMLПолеНаСервере()
	
	ПолеЧата = РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетHTML").ПолучитьТекст();     
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьHTMLПоле() 
	
	ОбновитьHTMLПолеНаСервере();
    

    // Формируем JavaScript код для ВСЕХ сообщений
    КодДляHTML = "const realMessages = [";
	ПервоеСообщение = Истина;
	
	Для Каждого Строка Из Объект.ТекущееОбращение.ИсторияСообщений Цикл
	    Если Не ПервоеСообщение Тогда
	        КодДляHTML = КодДляHTML + ",";
	    КонецЕсли;
	    
	    Текст = СтрЗаменить(Строка.Текст, """", "\""");
	    Текст = СтрЗаменить(Текст, "'", "\'");
	    Текст = СтрЗаменить(Текст, Символы.ПС, " ");
	    
	    КодДляHTML = КодДляHTML + "{";
	    КодДляHTML = КодДляHTML + "Текст: '" + Текст + "',";
	    КодДляHTML = КодДляHTML + "Автор: '" + Строка.Автор + "',";
	    КодДляHTML = КодДляHTML + "ДатаВремя: '" + Строка.ДатаВремя + "'";
	    КодДляHTML = КодДляHTML + "}";
	    
	    ПервоеСообщение = Ложь;   
		
	КонецЦикла;
	
	КодДляHTML = КодДляHTML + "]; loadMessages(realMessages);";
	
	// Заменяем тестовые данные на реальные
	ПолеЧата = СтрЗаменить(ПолеЧата, 
	    "loadMessages(exampleMessages);", 
	    КодДляHTML);
    
КонецПроцедуры


&НаСервере
Функция ОтправитьНаСервере()
 
	Если Не ПустаяСтрока(Объект.НаписатьСообщение) Тогда         
		Док = Объект.Ссыль.ПолучитьОбъект();
		 
		СтрокаИсторияСооб = Док.ИсторияСообщений.Добавить();
		СтрокаИсторияСооб.Автор = "Клиент";
		СтрокаИсторияСооб.ДатаВремя = ТекущаяДата();
		СтрокаИсторияСооб.Текст = Объект.НаписатьСообщение;
		Док.Записать();
				
		НоваяСтрокаИсторииВформе = Объект.ТекущееОбращение.ИсторияСообщений.Добавить();
	    НоваяСтрокаИсторииВформе.ДатаВремя = ТекущаяДата();
	    НоваяСтрокаИсторииВформе.Автор = "Клиент";
	    НоваяСтрокаИсторииВформе.Текст = Объект.НаписатьСообщение;
			
	КонецЕсли; 
	
	Попытка	
		Возврат Истина;
	Исключение
	    Сообщить("Ошибка при сохранении обращения: " + ОписаниеОшибки(), СтатусСообщения.Важное);
	    Возврат Ложь;
	КонецПопытки;
КонецФункции


&НаКлиенте
Процедура Отправить(Команда) 
	
	Успешно = ОтправитьНаСервере();
	
	Если Успешно Тогда
        Объект.НаписатьСообщение = "";  
		ОбновитьHTMLПоле();
	КонецЕсли;   

КонецПроцедуры
